exampleCases/emulsificationorg/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


((9.9572e-06 0.00031684 0)
(1.9905e-05 0.00031637 0)
(2.9832e-05 0.00031559 0)
(3.9731e-05 0.0003145 0)
(4.959e-05 0.0003131 0)
(5.94e-05 0.00031139 0)
(6.9151e-05 0.00030937 0)
(7.8835e-05 0.00030704 0)
(8.844e-05 0.00030441 0)
(9.7958e-05 0.00030148 0)
(0.00010738 0.00029826 0)
(0.0001167 0.00029474 0)
(0.0001259 0.00029093 0)
(0.00013497 0.00028683 0)
(0.00014391 0.00028245 0)
(0.00015272 0.00027779 0)
(0.00016137 0.00027286 0)
(0.00016986 0.00026765 0)
(0.00017818 0.00026218 0)
(0.00018633 0.00025646 0)
(0.00019429 0.00025048 0)
(0.00020206 0.00024425 0)
(0.00020964 0.00023779 0)
(0.000217 0.00023108 0)
(0.00022415 0.00022415 0)
(0.00023108 0.000217 0)
(0.00023779 0.00020964 0)
(0.00024425 0.00020206 0)
(0.00025048 0.00019429 0)
(0.00025646 0.00018633 0)
(0.00026218 0.00017818 0)
(0.00026765 0.00016986 0)
(0.00027286 0.00016137 0)
(0.00027779 0.00015272 0)
(0.00028245 0.00014391 0)
(0.00028683 0.00013497 0)
(0.00029093 0.0001259 0)
(0.00029474 0.0001167 0)
(0.00029826 0.00010738 0)
(0.00030148 9.7958e-05 0)
(0.00030441 8.844e-05 0)
(0.00030704 7.8835e-05 0)
(0.00030937 6.9151e-05 0)
(0.00031139 5.94e-05 0)
(0.0003131 4.959e-05 0)
(0.0003145 3.9731e-05 0)
(0.00031559 2.9832e-05 0)
(0.00031637 1.9905e-05 0)
(0.00031684 9.9572e-06 0)
(0.000317 -5.0977e-20 0)
(0.00031684 -9.9572e-06 0)
(0.00031637 -1.9905e-05 0)
(0.00031559 -2.9832e-05 0)
(0.0003145 -3.9731e-05 0)
(0.0003131 -4.959e-05 0)
(0.00031139 -5.94e-05 0)
(0.00030937 -6.9151e-05 0)
(0.00030704 -7.8835e-05 0)
(0.00030441 -8.844e-05 0)
(0.00030148 -9.7958e-05 0)
(0.00029826 -0.00010738 0)
(0.00029474 -0.0001167 0)
(0.00029093 -0.0001259 0)
(0.00028683 -0.00013497 0)
(0.00028245 -0.00014391 0)
(0.00027779 -0.00015272 0)
(0.00027286 -0.00016137 0)
(0.00026765 -0.00016986 0)
(0.00026218 -0.00017818 0)
(0.00025646 -0.00018633 0)
(0.00025048 -0.00019429 0)
(0.00024425 -0.00020206 0)
(0.00023779 -0.00020964 0)
(0.00023108 -0.000217 0)
(0.00022415 -0.00022415 0)
(0.000217 -0.00023108 0)
(0.00020964 -0.00023779 0)
(0.00020206 -0.00024425 0)
(0.00019429 -0.00025048 0)
(0.00018633 -0.00025646 0)
(0.00017818 -0.00026218 0)
(0.00016986 -0.00026765 0)
(0.00016137 -0.00027286 0)
(0.00015272 -0.00027779 0)
(0.00014391 -0.00028245 0)
(0.00013497 -0.00028683 0)
(0.0001259 -0.00029093 0)
(0.0001167 -0.00029474 0)
(0.00010738 -0.00029826 0)
(9.7958e-05 -0.00030148 0)
(8.844e-05 -0.00030441 0)
(7.8835e-05 -0.00030704 0)
(6.9151e-05 -0.00030937 0)
(5.94e-05 -0.00031139 0)
(4.959e-05 -0.0003131 0)
(3.9731e-05 -0.0003145 0)
(2.9832e-05 -0.00031559 0)
(1.9905e-05 -0.00031637 0)
(9.9572e-06 -0.00031684 0)
)

// ************************************************************************* //
